# What is pandas?
* pandas stands for Panel-Data.
* It is the most popular libary for data handling for python and is build directly off of Numpy.
* It is use for read, clean and predict feature engineering.

# Series

* A pandas series is very similar to a numpy array, except for the addition of a named index.
* We can use this named index to grab data from the array.

In [1]:
import numpy as np
import pandas as pd

## Creating a Series

* You can convert list,numpy array or dictionary to a series.

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

### Using List

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
# pd.Series by default take data and index values
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

### Using Numpy Arrays

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

### Using Dictionaries

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Using an index

In [11]:
sales_Q1 = pd.Series(data=[250,450,200,150],index = ['USA', 'China','India', 'Brazil'])

In [12]:
sales_Q1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [13]:
sales_Q2 = pd.Series([260,500,210,100],index = ['USA', 'China','India', 'Japan'])

In [14]:
sales_Q2

USA      260
China    500
India    210
Japan    100
dtype: int64

In [15]:
sales_Q1['USA']

250

# KEY ERROR!
# sales_Q1['Russia'] # wrong name!
# sales_Q1['USA '] # wrong string spacing!

In [16]:
# You can also combine series using (+)
sales_Q1 + sales_Q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

# DataFrame

* It is simply multiple pandas series that share the same index.
* DF is main tool for working with data.

In [17]:
import numpy as np
from numpy.random import randint
import pandas as pd

In [18]:
columns = ['W', 'X', 'Y', 'Z']  # Four columns
index = ['A', 'B', 'C', 'D', 'E'] # five rows

In [19]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [20]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [21]:
df = pd.DataFrame(data,index,columns)

In [22]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

## Selection and Indexing

In [23]:
# grab a single column
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [24]:
# pass a list of column names
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [25]:
# find type of column
type(df['W'])

pandas.core.series.Series

In [26]:
# Creating a new column:
df['new'] = df['W'] + df['Y']

In [27]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [28]:
# Removing Columns
df.drop('new', axis=1)   # axis=1 its a column

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [29]:
# Not inplce unless reassigned
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [30]:
df = df.drop('new', axis=1)

In [31]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [32]:
# working with rows
# selecting one row by name
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [33]:
# selecting multiple rows by name
df.loc[['A','C']]

   W   X   Y   Z
A  2  79  -8 -86
C  2  21 -26 -13

In [34]:
# Select single row by integer index location
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [35]:
# Selec multiple rows by index location
df.iloc[0:2]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80

In [36]:
# Remove row by name
df.drop('C',axis=0)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [37]:
# NOT IN PLACE
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [38]:
# Selecting sunset of rows and columns at same time
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

## Conditional Selection
An important feature of pandas is conditional selection using bracket notation, very similar to numpy.

In [39]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [40]:
df>0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [41]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [42]:
df['X']>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [43]:
df[df['X']>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [44]:
df[df['X']>0]['Y']

A    -8
C   -26
E   -48
Name: Y, dtype: int32

In [45]:
df[df['X']>0][['Y','Z']]

    Y   Z
A  -8 -86
C -26 -13
E -48 -99

In [46]:
# For two conditions you can use | and & with parenthesis:
df[(df['W']>0) & (df['Y']>1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [47]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [48]:
# Reset to default 0,1...n index
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [49]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [50]:
newind = 'CA NY WY OR CO'.split()

In [51]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [52]:
df['states'] = newind
df

    W   X   Y   Z states
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [55]:
df.set_index('states')

         W   X   Y   Z
states
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [56]:
df

    W   X   Y   Z states
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [57]:
df = df.set_index('states')

In [58]:
df

         W   X   Y   Z
states
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

## DataFrame Summaries
There are a couple of ways to obtain summary data on DataFrames.<br>
<tt><strong>df.describe()</strong></tt> provides summary statistics on all numerical columns.<br>
<tt><strong>df.info and df.dtypes</strong></tt> displays the data type of all columns.

In [59]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [60]:
df.dtypes

W    int32
X    int32
Y    int32
Z    int32
dtype: object

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int32
 1   X       5 non-null      int32
 2   Y       5 non-null      int32
 3   Z       5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

# Missing Data

In [62]:
df = pd.DataFrame({'A':[1,2,np.nan,4],
                  'B':[5,np.nan,np.nan,8],
                  'C':[10,20,30,40]})

In [63]:
# keeping missing data
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [65]:
# Removing missing data
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [66]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [67]:
# Threshold (Require that many non-NA values)
df.dropna(thresh=2)

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
3  4.0  8.0  40

In [68]:
# Filling in missing data
df.fillna(value='FILL VLAUE')

            A           B   C
0         1.0         5.0  10
1         2.0  FILL VLAUE  20
2  FILL VLAUE  FILL VLAUE  30
3         4.0         8.0  40

In [69]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [70]:
df['A'].fillna(value=0)

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [71]:
df['A'].fillna(df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
Name: A, dtype: float64

In [72]:
df.fillna(df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40